src/DataProcessors/ПечатьКонвертовНаклеек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьКонвертовНаклеек</Name>
			<Comment>Печать конвертов и наклеек</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДляПечатиНаклеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАдресаОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкаANSI</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЕУдалятьАвтоматическиПустыеЛистыWord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьАдресОтправителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКШаблону</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерыКонверта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Адрес</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Рассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Рассылка</Name>
			<Comment>Рассылка</Comment>
			<BasedOn>
				<xr:Item>Document.Рассылка</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Рассылка</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправителяSMS</Name>
					<Comment>Номер отправителя SMS</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Comment>Представление отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реклама</Name>
					<Comment>Реклама</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние рассылки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРассылок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Comment>Текст письма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Тема</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Comment>Учетная запись</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОДоставке</Name>
					<Comment>Уведомить о доставке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПрочтении</Name>
					<Comment>Уведомить о прочтении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТекста</Name>
					<Comment>Формат текста</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Comment>Шаблон анкеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SMS</Name>
							<Comment>SMS</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Адрес</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Comment>Адрес электронной почты</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отказ</Name>
							<Comment>Отказ</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Получатель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление получателя сообщения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОбработкиЗвонка</Name>
							<Comment>Результат обработки звонка</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыОбработкиЗвонка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Comment>Событие</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.Событие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Comment>Телефон</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектронноеПисьмо</Name>
							<Comment>Электронное письмо</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖалобаКлиента</Name>
							<Comment>Жалоба клиента</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЖалобаКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Звонок</Name>
							<Comment>Телефонный звонок</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ПечатьКонвертовНаклеек/Forms/Форма/Ext/Form/Module.bsl
// Модуль основной формы обработки "ПечатьКонвертовНаклеек"

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

#Область ОписаниеПеременных

Перем мКуда;			// Содержит назначение
Перем мОтправитель;		// Отправитель
Перем мПолучатель;		// Получатель

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьРежимПечатиСервер(РежимПечати)
	
	Если РежимПечати = 0 Тогда
		Заголовок = НСтр("ru = 'Печать конвертов'");
		Элементы.ФормаУстановитьРежимКонверты.Пометка = Истина;
		Элементы.ФормаУстановитьРежимНаклейки.Пометка = Ложь;
		Элементы.ПутьКШаблону.Видимость = Ложь;
		Элементы.РазмерыКонверта.Видимость = Истина;
		Элементы.Высота.Видимость = Истина;
		Элементы.Ширина.Видимость = Истина;
		Элементы.НЕУдалятьАвтоматическиПустыеЛистыWord.Видимость = Истина;
		Элементы.НадписьКомментарийВОРД.Видимость = Истина;
		Элементы.НадписьШирина.Видимость = Истина;
		Элементы.НадписьВысота.Видимость = Истина;
		Элементы.АдресДляПечатиНаклеек.Видимость = Ложь;	
	Иначе
		Заголовок = НСтр("ru = 'Печать наклеек'");
		Элементы.ФормаУстановитьРежимКонверты.Пометка = Ложь;
		Элементы.ФормаУстановитьРежимНаклейки.Пометка = Истина;
		Элементы.ПутьКШаблону.Видимость = Истина;
		Элементы.РазмерыКонверта.Видимость = Ложь;
		Элементы.Высота.Видимость = Ложь;
		Элементы.Ширина.Видимость = Ложь;
		Элементы.НЕУдалятьАвтоматическиПустыеЛистыWord.Видимость = Ложь;
		Элементы.НадписьКомментарийВОРД.Видимость = Ложь;
		Элементы.НадписьШирина.Видимость = Ложь;
		Элементы.НадписьВысота.Видимость = Ложь;
		Элементы.АдресДляПечатиНаклеек.Видимость = Истина;	
	КонецЕсли;
	Объект.Режим = РежимПечати;
		
КонецПроцедуры

&НаСервере
Функция МакетНаСервере()
	
	Макет = Новый ТабличныйДокумент;
	Макет.Прочитать(Объект.ПутьКШаблону);
	Возврат Макет; 
	
КонецФункции

// Процедура печати конвертов в word.
//
//
&НаСервере
Процедура ПечатьКонвертовWORD()
	
	Если  Объект.Контрагенты.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
		
	ИмяФайлаАдресов = КаталогВременныхФайлов()+"address.dbf";
	Текст = Новый XBase();
	Текст.Поля.Добавить("Address","S",254);
	Текст.Поля.Добавить("RAddress","S",254);
	Текст.Кодировка = ?(Объект.КодировкаANSI,КодировкаXBase.ANSI,КодировкаXBase.OEM);
	Текст.СоздатьФайл(ИмяФайлаАдресов);
	Если Текст.Открыта() Тогда
		Текст.ЗакрытьФайл();
	КонецЕсли;
	Текст.ОткрытьФайл(ИмяФайлаАдресов);
	Если НЕ Текст.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоКонвертов = 0;
	
	Для каждого Строка Из Объект.Контрагенты  Цикл
		
		Если НЕ Строка.Выбран Тогда
			Продолжить
		КонецЕсли;      
				
		Если НЕ ЗначениеЗаполнено(Строка.Адрес) Тогда
			Продолжить;
		КонецЕсли;      
		
		Текст.Добавить();
		СтруктураПредставления = Новый Структура;
		СтруктураПредставления.Вставить("Наименование", "");
		СтруктураПредставления.Вставить("ИНН",          "ИНН ");
		СтруктураПредставления.Вставить("КПП",          "КПП ");
		СтруктураПредставления.Вставить("ОКПО",         "Код по ОКПО ");
		
		Текст.Address = мКуда + Строка.Адрес + Символы.ПС 
						+ УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Строка.Контрагент,СтруктураПредставления);
		Текст.RAddress = Объект.АдресОтправителя;
		Текст.Записать();
		КоличествоКонвертов = КоличествоКонвертов+1;
		
	КонецЦикла;
	Текст.ЗакрытьФайл();
	
	Если КоличествоКонвертов = 0 Тогда 
		Возврат; 
	КонецЕсли; 
	
	Попытка
		Word = Новый ComОбъект("Word.Application");
	Исключение
		ВывестиСообщение(НСтр("ru = 'Программа Word не установлена на данном компьютере.'"),Объект);
		Возврат;
	КонецПопытки;
	
	Попытка
		
		Word.Documents.Add(,,,Истина);  //Add(Template, NewTemplate, DocumentType, Visible)
		
		// Template   Optional Variant. The name of the template to be used for the new document.
		//           If this argument is omitted, the Normal template is used.
		
		// NewTemplate   Optional Variant. True to open the document as a template. The default value is False.
		
		// DocumentType   Optional Variant. Can be one of the following WdNewDocumentType constants: wdNewBlankDocument,
		//                wdNewEmailMessage, wdNewFrameset, or wdNewWebPage. The default constant is wdNewBlankDocument.
		
		// Visible   Optional Variant. True to open the document in a visible window. If this value is False, Microsoft Word
		//			 opens the document but sets the Visible property of the document window to False. The default value is True.
		
		// Envelope  - конверт
		
		// ExtractAddress   Optional Variant. True to use the text marked by the EnvelopeAddress bookmark
		//                  (a user-defined bookmark) as the recipient's address.
		
		// Address   Optional Variant. A string that specifies the recipient's address (ignored if ExtractAddress is True).
		
		// AutoText   Optional Variant. A string that specifies an AutoText entry to use for the address.
		//             If specified, Address is ignored.
		
		// OmitReturnAddress   Optional Variant. True to not insert a return address.
		
		// ReturnAddress   Optional Variant. A string that specifies the return address.
		
		// ReturnAutoText   Optional Variant. A string that specifies an AutoText entry to use for the return address.
		//                  If specified, ReturnAddress is ignored.
		
		// PrintBarCode   Optional Variant. True to add a POSTNET bar code. For U.S. mail only.
		
		// PrintFIMA   Optional Variant. True to add a Facing Identification Mark (FIMA)
		//            for use in presorting courtesy reply mail. For U.S. mail only.
		
		
		Если Объект.РазмерыКонверта = НСтр("ru = 'Нестандартный размер'") Тогда
			Word.ActiveDocument.Envelope.DefaultHeight = Word.CentimetersToPoints (Объект.Высота);
			Word.ActiveDocument.Envelope.DefaultWidth = Word.CentimetersToPoints (Объект.Ширина);
		Иначе 
			Размеры = СформироватьРазмерыКонверта();
			Word.ActiveDocument.Envelope.DefaultHeight = Word.CentimetersToPoints (Размеры.Высота);
			Word.ActiveDocument.Envelope.DefaultWidth = Word.CentimetersToPoints (Размеры.Ширина);
		КонецЕсли;
		
		Word.ActiveWindow.WindowState = 1; // состояние окна 0 обычное, 1 свернуто, 2 развернуто
		
		Попытка
			Word.ActiveDocument.Envelope.Insert (Истина,"","", НЕ Объект.ПечататьАдресОтправителя,"","",Ложь,Ложь);//ExtractAddress, Address, AutoText, OmitReturnAddress, ReturnAddress, ReturnAutoText, PrintBarCode, PrintFIMA
		Исключение
			ВывестиСообщение(ОписаниеОшибки());
		КонецПопытки;
		
		Word.ActiveDocument.Envelope.AddressFromLeft = 0;// "wdAutoPosition"; 
		Word.ActiveDocument.Envelope.AddressFromTop = 0;// "wdAutoPosition"; 
		Word.ActiveDocument.Envelope.ReturnAddressFromLeft = 0;//"wdAutoPosition"; 
		Word.ActiveDocument.Envelope.ReturnAddressFromTop = 0;//"wdAutoPosition"; 
		
		
		Word.ActiveDocument.Envelope.DefaultFaceUp = Истина;  //True to print the envelope face up, False to print it face down.
		// Word.ActiveDocument.Envelope.DefaultOrientation = ; //Optional Variant. The orientation for the envelope.
		// #define wdLeftPortrait  0
		// #define wdCenterPortrait  1
		// #define wdRightPortrait  2
		// #define wdLeftLandscape  3
		// #define wdCenterLandscape  4
		// #define wdRightLandscape  5
		// #define wdLeftClockwise  6
		// #define wdCenterClockwise  7
		// #define wdRightClockwise  8.
		
		doc = Word.ActiveDocument;
		
		Word.ActiveDocument.MailMerge.MainDocumentType = "wdEnvelopes";
		Word.ActiveDocument.MailMerge.OpenDataSource (ИмяФайлаАдресов,"wdOpenFormatAuto", Ложь, Истина);
		Word.ActiveDocument.MailMerge.Fields.Add (Word.ActiveDocument.Envelope.Address,"Address");
		Если Объект.ПечататьАдресОтправителя  Тогда
			Word.ActiveDocument.MailMerge.Fields.Add (Word.ActiveDocument.Envelope.ReturnAddress,"RAddress");
		КонецЕсли;      
		Word.ActiveDocument.MailMerge.Destination = "wdSendToNewDocument";
		Word.ActiveDocument.MailMerge.SuppressBlankLines = Ложь;
		Word.ActiveDocument.MailMerge.DataSource.FirstRecord = Истина;
		Word.ActiveDocument.MailMerge.DataSource.LastRecord = КоличествоКонвертов;
		Word.ActiveDocument.MailMerge.Execute (Истина);                                                                                         
		
		LastDocument = Word.ActiveDocument;
		doc.Close(Ложь);
		
		Если НЕ Объект.НЕУдалятьАвтоматическиПустыеЛистыWord Тогда
			СчетчикИ = 1;
			СчетчикП = 1;
			КоличествоСимволов = LastDocument.Characters.Count;
			Пока LastDocument.Characters.Item (СчетчикИ) <> LastDocument.Characters.Last Цикл
				Если КодСимвола(LastDocument.Characters.Item (СчетчикИ).Text) = 12 Тогда
					Если СчетчикП - Цел(СчетчикП/2)*2 = 0 Тогда
						LastDocument.Characters.Item (СчетчикИ).Delete();
					КонецЕсли;      
					СчетчикП = СчетчикП + 1;
				КонецЕсли;      
				Если СчетчикИ =  LastDocument.Characters.Count - 2 Тогда
					Прервать;
				КонецЕсли;      
				СчетчикИ = СчетчикИ + 1;
			КонецЦикла;
		КонецЕсли;
		
		myRange = LastDocument.Range();
		Пока myRange.Find.Execute(СокрЛП(мКуда)) <> 0 Цикл
			myRange.Bold = Истина;
		КонецЦикла;                        
		myRange = LastDocument.Range();
		Пока myRange.Find.Execute(СокрЛП(мОтправитель)) <> 0 Цикл
			myRange.Bold = Истина;                
		КонецЦикла;                        
		myRange = LastDocument.Range();
		Пока myRange.Find.Execute(СокрЛП(мПолучатель)) <> 0 Цикл
			myRange.Bold = Истина;                
		КонецЦикла;                 

	Исключение
		ВывестиСообщение(ОписаниеОшибки());
		Word.Quit();
		Возврат;
	КонецПопытки;
	
	Word.Visible = 1;
КонецПроцедуры

// Функция формирования размера конверта.
//
//
&НаСервере
Функция СформироватьРазмерыКонверта()
	
	Размеры = Новый Структура;
	
	Если Объект.РазмерыКонверта = "C6" Тогда
		Размеры.Вставить("Ширина",16.2);
		Размеры.Вставить("Высота",11.4);
	ИначеЕсли Объект.РазмерыКонверта = "E65" Тогда 
	    Размеры.Вставить("Ширина",22.0);
		Размеры.Вставить("Высота",11.0);
	ИначеЕсли Объект.РазмерыКонверта = "C5" Тогда 
	    Размеры.Вставить("Ширина",22.9); 	
		Размеры.Вставить("Высота",16.2);
	ИначеЕсли Объект.РазмерыКонверта = "C4" Тогда 
	    Размеры.Вставить("Ширина",32.4); 
		Размеры.Вставить("Высота",22.9);
	ИначеЕсли Объект.РазмерыКонверта = "B4" Тогда 
	    Размеры.Вставить("Ширина",35.3);
		Размеры.Вставить("Высота",25.0);
	ИначеЕсли Объект.РазмерыКонверта = "K65" Тогда 
		Размеры.Вставить("Ширина",19.0);
		Размеры.Вставить("Высота",12.5);
	ИначеЕсли Объект.РазмерыКонверта = "K5" Тогда 
		Размеры.Вставить("Ширина",21.5);
		Размеры.Вставить("Высота",14.5);
	КонецЕсли;	
	
	Возврат Размеры;
	
КонецФункции	

// Процедура управления видимостью настроек.
//
//
&НаКлиенте
Процедура ВидимостьНастройкиРазмеровКонверта(Видимость)
	
	Элементы.Ширина.Видимость = Видимость;
	Элементы.Высота.Видимость = Видимость;
	Элементы.НадписьВысота.Видимость = Видимость;
	Элементы.НадписьШирина.Видимость = Видимость;
		
КонецПроцедуры	

&НаКлиенте
Процедура ВидимостьЭлементовУправления()
	
	Если Объект.ПечататьАдресОтправителя Тогда
		Элементы.ГруппаНастройкиОтправителя.Видимость = Истина;
		Элементы.АдресОтправителя.Видимость 		= Истина;
		Элементы.ВидАдресаОрганизации.Видимость 	= Истина;
		Элементы.ОрганизацияОтправитель.Видимость 	= Истина;
	Иначе
		Элементы.ГруппаНастройкиОтправителя.Видимость = Ложь;
		Элементы.АдресОтправителя.Видимость 		= Ложь;
		Элементы.ВидАдресаОрганизации.Видимость 	= Ложь;
		Элементы.ОрганизацияОтправитель.Видимость 	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Функция определения адреса объекта.
//
//
&НаСервере
Функция ОпределитьАдресОбъекта(Организация)
		
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат "";	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Представление,
	|	Организации.НаименованиеПолное
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОрганизацииКонтактнаяИнформация.Ссылка = Организации.Ссылка
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка = &Объект
	|	И ОрганизацииКонтактнаяИнформация.Вид = &Вид
	|	И ОрганизацииКонтактнаяИнформация.Тип = &Тип";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Объект",Организация);
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид",Объект.ВидАдресаОрганизации);
		
	ВыборкаАдресов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаАдресов.Следующий() Цикл
		
		Наименование = ВыборкаАдресов.НаименованиеПолное; 

		Возврат ВыборкаАдресов.Представление + Символы.ПС + Наименование+Символы.ПС;
		
	КонецЦикла;		
	
КонецФункции	

&НаКлиенте
Процедура СформироватьАдресОтправителя()
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияОтправитель) Тогда
		Объект.АдресОтправителя = "";
		Объект.АдресОтправителя = "Отправитель:" + " " + ОпределитьАдресОбъекта(Объект.ОрганизацияОтправитель);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при выполнении команды "Подбор".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	// Получим список адресатов
	СоответствиеТабличныхЧастей = Новый Соответствие;
	СоответствиеТабличныхЧастей.Вставить("Получатель", Объект.Контрагенты);
	КИ = "Адрес";
	
	СписокВыбранных = Новый СписокЗначений;
	Для Каждого ТабличнаяЧасть Из СоответствиеТабличныхЧастей Цикл
		
		Результат = Новый Массив;
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть.Значение Цикл
			Контакт = ?(ТипЗнч(СтрокаТаблицы.Контрагент) = Тип("Строка"), Неопределено, СтрокаТаблицы.Контрагент);
			Запись = Новый Структура(
			"Адрес, Представление, Контакт", СтрокаТаблицы[КИ],Строка(СтрокаТаблицы.Контрагент), СтрокаТаблицы.Контрагент);
			Если ЗначениеЗаполнено(Запись.Адрес) Тогда
				Результат.Добавить(Запись);
			КонецЕсли;
		КонецЦикла;
		СписокВыбранных.Добавить(Результат,ТабличнаяЧасть.Ключ);
	КонецЦикла;
	
	СписокТиповКонтактов = Новый Массив;
	СписокТиповКонтактов.Добавить("Страница_Контрагенты");
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("СписокВыбранных", СписокВыбранных);
	ПараметрыОткрытия.Вставить("Предмет", Неопределено);
	ПараметрыОткрытия.Вставить("Письмо", Объект);
	ПараметрыОткрытия.Вставить("ГруппаПоУмолчанию",НСтр("ru = 'Получатель'"));
	ПараметрыОткрытия.Вставить("СписокТиповКонтактов",СписокТиповКонтактов);
	ПараметрыОткрытия.Вставить("ТипКИ",ТипКИ);
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаПодборКонтрагентов");
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект, ПараметрыВызова);
	ОткрытьФорму("ОбщаяФорма.АдреснаяКнига",ПараметрыОткрытия, ЭтотОбъект,,,,Оповещение);

	
КонецПроцедуры // Подбор()

&НаКлиенте
Процедура ВыбратьСтроки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.Контрагенты Цикл
		СтрокаТЧ.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьСтроки(Команда)

	Для Каждого СтрокаТЧ Из Объект.Контрагенты Цикл
		СтрокаТЧ.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимНаклейки(Команда)
	УстановитьРежимПечатиСервер(1);
	Объект.ПечататьАдресОтправителя = Ложь;
	ВидимостьЭлементовУправления();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимКонверты(Команда)
	УстановитьРежимПечатиСервер(0);
	Объект.ПечататьАдресОтправителя = Ложь;
	ВидимостьЭлементовУправления();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Объект.Режим = 0 Тогда
		ПечатьКонвертовWORD();
	ИначеЕсли Объект.Режим = 1 Тогда
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Объект.ОрганизацияОтправитель);
		Настройки = Новый Структура;
		Настройки.Вставить("АдресДляПечатиНаклеек", Объект.АдресДляПечатиНаклеек);
		Настройки.Вставить("АдресОтправителя", Объект.АдресОтправителя);
		Настройки.Вставить("Контрагенты",      Объект.Контрагенты);
		Настройки.Вставить("мКуда", "Куда: ");
		Если НЕ ПустаяСтрока(СокрЛП(Объект.ПутьКШаблону)) Тогда 
			Настройки.Вставить("ВнешнийМакет", МакетНаСервере());
		КонецЕсли;
			
		ПараметрыПечати = Новый Структура("СтруктураНастроек",Настройки);	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		    "Обработка.ПечатьКонвертовНаклеек",
		    "ШаблонНаклеек",
		    ПараметрКоманды,
		    Неопределено,
		 	ПараметрыПечати);
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ


&НаКлиенте
Процедура ОрганизацияОтправительПриИзменении(Элемент)
	 СформироватьАдресОтправителя();
КонецПроцедуры

&НаКлиенте
Процедура ПечататьАдресОтправителяПриИзменении(Элемент)
	ВидимостьЭлементовУправления();
КонецПроцедуры

&НаКлиенте
Процедура ВидАдресаОрганизацииПриИзменении(Элемент)
	 СформироватьАдресОтправителя();
КонецПроцедуры

&НаКлиенте
Процедура АдресДляПечатиНаклеекПриИзменении(Элемент)
	Если Объект.АдресДляПечатиНаклеек = 0 Тогда 
		Объект.ПечататьАдресОтправителя = Ложь;
		ВидимостьЭлементовУправления();
	Иначе 	
		Объект.ПечататьАдресОтправителя = Истина;
		ВидимостьЭлементовУправления();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидАдресаОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ПараметрыОтбора.Вставить("Родитель",  ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникОрганизации"));
	ПараметрыОтбора.Вставить("ЭтаГруппа",  Ложь);

	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("РежимВыбора", 	Истина);
	
	ПараметрыПодбора.Вставить("Отбор", 	ПараметрыОтбора);
	ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",
														ЭтотОбъект,"КомандаВыбораВидаКИОрганизации");
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.ФормаВыбора",ПараметрыПодбора,ЭтотОбъект,,,,ОповещениеЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКШаблонуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Табличный документ (*.mxl)|*.mxl";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл шаблона'");
		
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если ДиалогОткрытияФайла.ВыбранныеФайлы.Количество() = 0 Тогда	
		Возврат;	
	КонецЕсли; 
	
	Объект.ПутьКШаблону = ДиалогОткрытияФайла.ВыбранныеФайлы[0];

КонецПроцедуры

&НаКлиенте
Процедура ПутьКШаблонуОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ПустаяСтрока(СокрЛП(Объект.ПутьКШаблону)) Тогда Возврат КонецЕсли;
	СтандартнаяОбработка  = Ложь;
	Макет = МакетНаСервере();
	Макет.Показать(НСтр("ru = 'Макет печати наклеек'"),Объект.ПутьКШаблону);

КонецПроцедуры

&НаКлиенте
Процедура РазмерыКонвертаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = НСтр("ru = 'Нестандартный размер'") Тогда
		ВидимостьНастройкиРазмеровКонверта(Истина);
	Иначе
		ВидимостьНастройкиРазмеровКонверта(Ложь);
    КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "КОНТРАГЕНТЫ"


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "КОНТРАГЕНТЫ"


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документы") Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РассылкаПолучатели.Получатель КАК Контрагент,
			|	РассылкаПолучатели.Адрес,
			|	ИСТИНА КАК Выбран
			|ИЗ
			|	Документ.Рассылка.Получатели КАК РассылкаПолучатели
			|ГДЕ
			|	РассылкаПолучатели.Ссылка В(&СписокДокументов)
			|	И (ВЫРАЗИТЬ(РассылкаПолучатели.Адрес КАК СТРОКА(1))) <> """"";
		
		Запрос.УстановитьПараметр("СписокДокументов", Параметры.Документы);
		
		Контрагенты = Запрос.Выполнить().Выгрузить();
		Контрагенты.Свернуть("Адрес,Контрагент,Выбран");
	    Объект.Контрагенты.Загрузить(Контрагенты);
	КонецЕсли;
	
	// Начальное заполнение
	ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Объект.РазмерыКонверта = НСтр("ru = 'Нестандартный размер'");
	Объект.Высота = 11;
	Объект.Ширина = 22;
	Объект.ПечататьАдресОтправителя = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьРежимПечатиСервер(Объект.Режим);
	ВидимостьЭлементовУправления();

КонецПроцедуры

&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события.
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, 
																						ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента.
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, 
																						ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;	
		
	Если ДополнительныеПараметры = "КомандаВыбораВидаКИОрганизации" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Объект.ВидАдресаОрганизации = РезультатОповещения;
			СформироватьАдресОтправителя();
		КонецЕсли;
		Возврат;	
 	
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") 
		И ДополнительныеПараметры.КомандаОповещения = "КомандаПодборКонтрагентов" Тогда
		
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Объект.Контрагенты.Очистить();
			Для Каждого Элемент Из РезультатОповещения Цикл
				СтруктураПоиска = Новый Структура();
				СтруктураПоиска.Вставить("Контрагент",Элемент.Контакт);
				СтруктураПоиска.Вставить("Адрес",Элемент.Адрес);
				МассивСтрок = Объект.Контрагенты.НайтиСтроки(СтруктураПоиска);
				Если МассивСтрок.Количество() = 0 Тогда 
					СтрокаТЧ = Объект.Контрагенты.Добавить();
					СтрокаТЧ.Контрагент = Элемент.Контакт;
					СтрокаТЧ.Адрес 		= Элемент.Адрес;
					СтрокаТЧ.Выбран 	= Истина;
				КонецЕсли;;
			КонецЦикла;
		КонецЕсли;
		Возврат;	
	КонецЕсли;
		
	// Обработаем событие в контексте сервера.
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
		
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

мКуда = "Куда:" + " ";
мОтправитель = "Отправитель:" + " ";
мПолучатель = "Получатель:" + " ";

#КонецОбласти
